In [1]:
import pandas as pd

# Ways to Randomly Select Rows from Pandas DataFrame

In [6]:
df=pd.read_csv('https://raw.githubusercontent.com/justmarkham/DAT8/master/data/u.user', sep='|')
df

     user_id  age gender     occupation zip_code
0          1   24      M     technician    85711
1          2   53      F          other    94043
2          3   23      M         writer    32067
3          4   24      M     technician    43537
4          5   33      F          other    15213
..       ...  ...    ...            ...      ...
938      939   26      F        student    33319
939      940   32      M  administrator    02215
940      941   20      M        student    97229
941      942   48      F      librarian    78209
942      943   22      M        student    77841

[943 rows x 5 columns]

## Randomly select a single row:

In [7]:
df1 = df.sample()
df1

     user_id  age gender  occupation zip_code
403      404   29      F  programmer    55108

## Randomly select a specified number of rows. 

For example, to select 3 random rows, set n=3:

In [8]:
df2= df.sample(n=3)
df2

     user_id  age gender occupation zip_code
807      808   45      M   salesman    90016
412      413   55      M   educator    78212
770      771   26      M    student    15232

## Allow a random selection of the same row more than once (by setting replace=True):

In [9]:
df3= df.sample(n=3,replace=True)
df3

     user_id  age gender occupation zip_code
480      481   73      M    retired    37771
889      890   32      M    student    97301
506      507   18      F     writer    28450

## Randomly select a specified fraction of the total number of rows. 

For example, if you have 8 rows, and you set frac=0.50, then you’ll get a random selection of 50% of the total rows, meaning that 4 rows will be selected:

In [10]:
df4 = df.sample(frac=0.50)
df4

     user_id  age gender occupation zip_code
600      601   19      F     artist    99687
158      159   23      F    student    55346
502      503   50      F     writer    27514
246      247   28      M   engineer    20770
450      451   16      M    student    48446
..       ...  ...    ...        ...      ...
20        21   26      M     writer    30068
182      183   33      M  scientist    27708
819      820   22      M    student    37725
396      397   17      M    student    27514
463      464   60      M     writer    94583

[472 rows x 5 columns]